CSI API ETABS v1

# cOAPISetAsActiveObject Method

---

This function sets the active ETABSObject instance in the system Running
Object Table (ROT), replacing the previous instance (if any).

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetAsActiveObject()

    Function SetAsActiveObject As Integer

    Dim instance As cOAPI
    Dim returnValue As Integer

    returnValue = instance.SetAsActiveObject()

    int SetAsActiveObject()

    abstract SetAsActiveObject : unit -> int

#### Return Value

Type: Int32
This function returns zero if the current instance is successfully added to
the system ROT and nonzero if it fails.

Remarks

When a new ETABSObject is created using the API, it is automatically added to
the system ROT if none is already present. Creation of subsequent ETABSObject
instances does not alter the ROT as long as at least one active instance is
present in the ROT.
GetObject(String) can be used to
attach to the active ETABSObject instance registered in the ROT.

Examples

VB

Copy

    Public Sub Example()
           Dim EtabsObject As cOAPI
           Dim ret As Integer = -1

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'set as active instance
           ret = EtabsObject.SetAsActiveObject

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cOAPI Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com